package io.yaooo.common;

/******************************************************************************
 * Created by  Yao  on  2016/7/4
 * README:日志类型枚举
 *GENERAL--一般类
 *SEAERCH--用户搜索关键词类
 *UI--用户界面点击交互类
 *ACCOUNT--账户资料修改类
 *LOGIN--用户登陆退出类
 *DELETE--数据删除类
 *CRU--数据库特殊操作类
 * ============================================================================
 * CHANGELOG：
 ******************************************************************************/
public enum LogType {
        GENERAL,
        SEAERCH,
        UI,
        ACCOUNT,
        LOGIN,
        DELETE,
        CRU
}
